results/20260626_150635_all_baseline/rust-http/k6_stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/puvish/Projects/python-bun-go-rust-perf-comparison/k6/baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 921 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 1789 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 2645 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 3484 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 4326 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 5169 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 6008 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 6837 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 7683 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 8521 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 9367 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 10204 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 11037 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 11875 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 12718 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 13553 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 14391 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 15221 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 16055 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 16894 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 17728 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 18557 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 19388 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 20230 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 21064 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 21902 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 22726 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 23562 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 24401 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 25239 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 26074 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 26910 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 27732 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 28561 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 29395 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 30228 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 31046 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 31886 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 32724 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 33557 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 34390 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 35217 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 36040 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 36879 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 37712 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 38551 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 39381 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 40228 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 41060 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 41893 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 42730 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 43556 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 44382 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 45209 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 46030 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 46854 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 47668 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 48493 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 49319 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 50151 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 100328  1671.87991/s
    checks_succeeded...: 100.00% 100328 out of 100328
    checks_failed......: 0.00%   0 out of 100328

    ✓ status 200
    ✓ has DONE

    HTTP
    http_req_duration..............: avg=11.75ms min=2.54ms med=11.13ms max=41.89ms p(90)=17.77ms p(95)=20.16ms
      { expected_response:true }...: avg=11.75ms min=2.54ms med=11.13ms max=41.89ms p(90)=17.77ms p(95)=20.16ms
    http_req_failed................: 0.00%  0 out of 50164
    http_reqs......................: 50164  835.939955/s

    EXECUTION
    iteration_duration.............: avg=11.94ms min=2.64ms med=11.31ms max=41.97ms p(90)=18.01ms p(95)=20.39ms
    iterations.....................: 50164  835.939955/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 437 MB 7.3 MB/s
    data_sent......................: 8.2 MB 136 kB/s



running (1m00.0s), 00/10 VUs, 50164 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s